# ActLayer

## Description
Function ActLayer returns a handle to the currently active layer in a document.

```pascal
FUNCTION ActLayer : HANDLE;
```

```python
def vs.ActLayer():
    return HANDLE
```

## Remarks
For changing the active layer you can use Layer.

## Examples
```pascal
resultH := ActLayer;
```
```python
activeLayerName = vs.GetLName( vs.ActLayer() )

if ( objH == None ) or ( vs.IsNewCustomObject( vs.GetName( objH ) ) ):
	containerHandle = vs.ActLayer()
```
See also in tutorials: 10. Iterate the Drawing and Report a Summary, 23. Count Objects by Criteria (Formula-Driven), 25. Geometric Property Extraction Table, 27. Formatted Wall Schedule

## See Also
VS Functions:
ActiveClass
| ActSymDef
| GetLName

## Version
Availability: from All Versions

## Category
* Layers